# **Pandas 23 - Seleksi Baris pada Data Frame dengan Query**

### Import Modules

In [2]:
import pandas as pd

print(pd.__version__)

2.2.0

### Persiapan Data Frame

In [3]:
d = {'kolom_satu':[1, 2, 3, 4, 5], 
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

### Seleksi baris dengan query()

In [4]:
# Melakukan query pada DataFrame 'df' untuk memfilter baris-baris di mana nilai kolom 'kolom_satu' lebih besar dari 2.
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

In [5]:
df.query('`kolom dua` > 30') #lebih dari 30

   kolom_satu  kolom dua
3           4         40
4           5         50